---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.SystemCalculationLevel
source: html/943d63fc-da2f-f981-5668-8a45b34e0e91.htm
---
# Autodesk.Revit.DB.Mechanical.SystemCalculationLevel

Enumerated type listing flags that can toggle on or off certain calculations related to MEP systems.

## Syntax (C#)
```csharp
public enum SystemCalculationLevel
```